Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/video/driver/RTL8735B/fcs_hal/rtl8735b_voe_type.h
#ifndef _RTL8735B_VOE_TYPE_H_
#define _RTL8735B_VOE_TYPE_H_

/**************************************************************************//**
 * @defgroup VOE_REG_VOE_SYSTEM_CTRL
 * @brief  N/A                                       (@ 0X00)
 * @{
 *****************************************************************************/
#define VOE_SHIFT_RSVD1                              3
#define VOE_MASK_RSVD1                               ((u32)0x1FFFFFFF << 3)                              /*!<R/W 0  RSVD */
#define VOE_SHIFT_KM_RESET_DIS                       2
#define VOE_BIT_KM_RESET_DIS                         ((u32)0x00000001 << 2)                              /*!<R/W 0  0': Disable KM; '1': Enable KM */
#define VOE_SHIFT_VOE_RESET_DIS                      1
#define VOE_BIT_VOE_RESET_DIS                        ((u32)0x00000001 << 1)                              /*!<R/W 1  0': Disable VOE function; '1': Enable VOE function */
#define VOE_SHIFT_CLOCK_GATING_DIS                   0
#define VOE_BIT_CLOCK_GATING_DIS                     ((u32)0x00000001 << 0)                              /*!<R/W 1  0': Disable VOE clock; '1': Enable VOE clock */
/** @} */

/**************************************************************************//**
 * @defgroup VOE_REG_KM_FW_BASE_ADDRESS
 * @brief  N/A                                       (@ 0X04)
 * @{
 *****************************************************************************/
#define VOE_SHIFT_KM_FW_BASE_ADDR                    0
#define VOE_MASK_KM_FW_BASE_ADDR                     ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  When KM boots, rom code should read this register to get the location of ram code. Then, it also should read 'REG_KM_FW_LEN' and copy the fw into memory of VOE. */
/** @} */

/**************************************************************************//**
 * @defgroup VOE_REG_KM_FW_LEN
 * @brief  N/A                                       (@ 0X08)
 * @{
 *****************************************************************************/
#define VOE_SHIFT_KM_FW_LEN                          0
#define VOE_MASK_KM_FW_LEN                           ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  Same ad 'REG_KM_FW_BASE_ADDRESS' */
/** @} */

/**************************************************************************//**
 * @defgroup VOE_REG_SEND_MESSAGE_EXTERNAL_CTRL
 * @brief  N/A                                       (@ 0X0C)
 * @{
 *****************************************************************************/
#define VOE_SHIFT_INVALID_AP_QUEUE                   31
#define VOE_BIT_INVALID_AP_QUEUE                     ((u32)0x00000001 << 31)                             /*!<r/wonce 0  0': Default value '1': Trigger interrupt to KM. */
#define VOE_SHIFT_RSVD2                              30
#define VOE_BIT_RSVD2                                ((u32)0x00000001 << 30)                             /*!<-- 0  RSVD */
#define VOE_SHIFT_MESSAGE                            0
#define VOE_MASK_MESSAGE                             ((u32)0x3FFFFFFF << 0)                              /*!<R/W 0  Message from AP */
/** @} */

/**************************************************************************//**
 * @defgroup VOE_REG_READ_MESSAGE_EXTERNAL_CTRL
 * @brief  N/A                                       (@ 0X10)
 * @{
 *****************************************************************************/
#define VOE_SHIFT_INVALID_VOE_QUEUE                  31
#define VOE_BIT_INVALID_VOE_QUEUE                    ((u32)0x00000001 << 31)                             /*!<r/w 0  0': Default value; When this bit is written to '0', FSM should clean the bit 0x108[31] 'REG_SEND_MESSAGE_KM_CTRL'. And FSM also should clean 0x108[29:0] '1': Trigger interrupt to the external CPU */
#define VOE_SHIFT_RSVD3                              30
#define VOE_BIT_RSVD3                                ((u32)0x00000001 << 30)                             /*!<-- 0  RSVD */
#define VOE_SHIFT_MESSAGE                            0
#define VOE_MASK_MESSAGE                             ((u32)0x3FFFFFFF << 0)                              /*!<R 0  Message from VOE and thie field equal to 0x108[29:0] 'REG_SEND_MESSAGE_KM_CTRL' */
/** @} */

/**************************************************************************//**
 * @defgroup VOE_REG_INTERRUPT_STATUS_OF_EXTERNAL_CPU
 * @brief  N/A                                       (@ 0X14)
 * @{
 *****************************************************************************/
#define VOE_SHIFT_RSVD4                              24
#define VOE_MASK_RSVD4                               ((u32)0x000000FF << 24)                             /*!<R/W 0  RSVD */
#define VOE_SHIFT_RSVD5                              25
#define VOE_BIT_RSVD5                                ((u32)0x00000001 << 25)                             /*!<R/W 0  RSVD */
#define VOE_SHIFT_RSVD6                              24
#define VOE_BIT_RSVD6                                ((u32)0x00000001 << 24)                             /*!<R/W 0  RSVD */
#define VOE_SHIFT_RSVD7                              18
#define VOE_MASK_RSVD7                               ((u32)0x0000003F << 18)                             /*!<R/W 0  RSVD */
#define VOE_SHIFT_RSVD8                              17
#define VOE_BIT_RSVD8                                ((u32)0x00000001 << 17)                             /*!<R/W 0  RSVD */
#define VOE_SHIFT_RSVD9                              16
#define VOE_BIT_RSVD9                                ((u32)0x00000001 << 16)                             /*!<R/W 0  RSVD */
#define VOE_SHIFT_RSVD10                             9
#define VOE_MASK_RSVD10                              ((u32)0x0000007F << 9)                              /*!<R/W 0  RSVD */
#define VOE_SHIFT_ERAC_FINISH                        8
#define VOE_BIT_ERAC_FINISH                          ((u32)0x00000001 << 8)                              /*!<R/W1C 0  ERAC finsh write/read */
#define VOE_SHIFT_RSVD11                             1
#define VOE_MASK_RSVD11                              ((u32)0x0000007F << 1)                              /*!<R/W 0  RSVD */
#define VOE_SHIFT_KM_MESSAGE_ISR_STATUS              0
#define VOE_BIT_KM_MESSAGE_ISR_STATUS                ((u32)0x00000001 << 0)                              /*!<R/W1C 0  0': default '1': When KM set 0x108[31] REG_SEND_MESSAGE_KM_CTRL, FSM will set this bit to '1'. And this bit will be clear with writing '1'. */
/** @} */

/**************************************************************************//**
 * @defgroup VOE_REG_INTERRUPT_MASK_OF_EXTERNAL_CPU
 * @brief  N/A                                       (@ 0X18)
 * @{
 *****************************************************************************/
#define VOE_SHIFT_RSVD12                             26
#define VOE_MASK_RSVD12                              ((u32)0x0000003F << 26)                             /*!<R/W 0  RSVD */
#define VOE_SHIFT_RSVD13                             25
#define VOE_BIT_RSVD13                               ((u32)0x00000001 << 25)                             /*!<R/W 0  RSVD */
#define VOE_SHIFT_RSVD14                             24
#define VOE_BIT_RSVD14                               ((u32)0x00000001 << 24)                             /*!<R/W 0  RSVD */
#define VOE_SHIFT_RSVD15                             18
#define VOE_MASK_RSVD15                              ((u32)0x0000003F << 18)                             /*!<R/W 0  RSVD */
#define VOE_SHIFT_RSVD16                             17
#define VOE_BIT_RSVD16                               ((u32)0x00000001 << 17)                             /*!<R/W 0  RSVD */
#define VOE_SHIFT_RSVD17                             16
#define VOE_BIT_RSVD17                               ((u32)0x00000001 << 16)                             /*!<R/W 0  RSVD */
#define VOE_SHIFT_RSVD18                             9
#define VOE_MASK_RSVD18                              ((u32)0x0000007F << 9)                              /*!<R/W 0  RSVD */
#define VOE_SHIFT_ERAC_AP_FINISH_EN                  8
#define VOE_BIT_ERAC_AP_FINISH_EN                    ((u32)0x00000001 << 8)                              /*!<R/W 0  ERAC finsh write/read */
#define VOE_SHIFT_RSVD19                             1
#define VOE_MASK_RSVD19                              ((u32)0x0000007F << 1)                              /*!<R/W 0  RSVD */
#define VOE_SHIFT_KM_MESSAGE_ISR_EN                  0
#define VOE_BIT_KM_MESSAGE_ISR_EN                    ((u32)0x00000001 << 0)                              /*!<R/W 0  0': Default; disable interrupt '1': Enable the interrupt where KM set 0x108[31] REG_SEND_MESSAGE_KM_CTRL. */
/** @} */

/**************************************************************************//**
 * @defgroup VOE_REG_VOE_ARB_PRIORITY_CTRL0
 * @brief  N/A                                       (@ 0X100)
 * @{
 *****************************************************************************/
#define VOE_SHIFT_RSVD20                             16
#define VOE_MASK_RSVD20                              ((u32)0x0000FFFF << 16)                             /*!<R/W 0  RSVD */
#define VOE_SHIFT_ARB_WR_PRIOR                       0
#define VOE_MASK_ARB_WR_PRIOR                        ((u32)0x0000FFFF << 0)                              /*!<R/W h8421  AXI aribter write priority.should be set to exclusive number of '8, 4, 2, 1' */
/** @} */

/**************************************************************************//**
 * @defgroup VOE_REG_VOE_ARB_PRIORITY_CTRL1
 * @brief  N/A                                       (@ 0X104)
 * @{
 *****************************************************************************/
#define VOE_SHIFT_RSVD21                             16
#define VOE_MASK_RSVD21                              ((u32)0x0000FFFF << 16)                             /*!<R/W 0  RSVD */
#define VOE_SHIFT_ARB_RD_PRIOR                       0
#define VOE_MASK_ARB_RD_PRIOR                        ((u32)0x0000FFFF << 0)                              /*!<R/W h8421  AXI ariber read priority should be set to exclusive number of '8, 4, 2, 1' */
/** @} */

/**************************************************************************//**
 * @defgroup VOE_REG_SEND_MESSAGE_KM_CTRL
 * @brief  N/A                                       (@ 0X108)
 * @{
 *****************************************************************************/
#define VOE_SHIFT_INVALID_AP_QUEUE                   31
#define VOE_BIT_INVALID_AP_QUEUE                     ((u32)0x00000001 << 31)                             /*!<r/wonce 0  0': Default value '1': Trigger interrupt to the external CPU. */
#define VOE_SHIFT_RSVD22                             30
#define VOE_BIT_RSVD22                               ((u32)0x00000001 << 30)                             /*!<-- 0  RSVD */
#define VOE_SHIFT_MESSAGE                            0
#define VOE_MASK_MESSAGE                             ((u32)0x3FFFFFFF << 0)                              /*!<R/W 0  Message from KM */
/** @} */

/**************************************************************************//**
 * @defgroup VOE_REG_READ_MESSAGE_KM_CTRL
 * @brief  N/A                                       (@ 0X10C)
 * @{
 *****************************************************************************/
#define VOE_SHIFT_INVALID_VOE_QUEUE                  31
#define VOE_BIT_INVALID_VOE_QUEUE                    ((u32)0x00000001 << 31)                             /*!<r/w 0  0': Default value; When this bit is written to '0', FSM should clean the bit 0x0C[31] 'REG_SEND_MESSAGE_EXTERNAL_CTRL'. And FSM also should clean 0x0C[29:0] '1': Trigger interrupt to the external CPU */
#define VOE_SHIFT_RSVD23                             30
#define VOE_BIT_RSVD23                               ((u32)0x00000001 << 30)                             /*!<-- 0  RSVD */
#define VOE_SHIFT_MESSAGE                            0
#define VOE_MASK_MESSAGE                             ((u32)0x3FFFFFFF << 0)                              /*!<R 0  Message from the external cpu and thie field equal to 0x0C[29:0] 'REG_SEND_MESSAGE_EXTERNAL_CTRL' */
/** @} */

/**************************************************************************//**
 * @defgroup VOE_REG_INTERRUPT_STATUS_OF_KM
 * @brief  N/A                                       (@ 0X110)
 * @{
 *****************************************************************************/
#define VOE_SHIFT_RSVD24                             27
#define VOE_MASK_RSVD24                              ((u32)0x0000001F << 27)                             /*!<R/W 0  RSVD */
#define VOE_SHIFT_SCRYPTO_ISR_STATUS                 26
#define VOE_BIT_SCRYPTO_ISR_STATUS                   ((u32)0x00000001 << 26)                             /*!<R/W1C 0  0': Default; there is no active interrupt '1': There is a active interrupt from SCrypto */
#define VOE_SHIFT_I2C2_ISR_STATUS                    25
#define VOE_BIT_I2C2_ISR_STATUS                      ((u32)0x00000001 << 25)                             /*!<R/W1C 0  0': Default; there is no active interrupt '1': There is a active interrupt from I2C2 */
#define VOE_SHIFT_NN_ISR_STATUS                      24
#define VOE_BIT_NN_ISR_STATUS                        ((u32)0x00000001 << 24)                             /*!<R/W1C 0  0': Default; there is no active interrupt '1': There is a active interrupt from NN */
#define VOE_SHIFT_GDMA1_ISR_STATUS                   23
#define VOE_BIT_GDMA1_ISR_STATUS                     ((u32)0x00000001 << 23)                             /*!<R/W1C 0  0': Default; there is no active interrupt '1': There is a active interrupt from GDMA1 */
#define VOE_SHIFT_GDMA0_G0_ISR_STATUS                22
#define VOE_BIT_GDMA0_G0_ISR_STATUS                  ((u32)0x00000001 << 22)                             /*!<R/W1C 0  0': Default; there is no active interrupt '1': There is a active interrupt from GDMA0 */
#define VOE_SHIFT_I2C3_ISR_STATUS                    21
#define VOE_BIT_I2C3_ISR_STATUS                      ((u32)0x00000001 << 21)                             /*!<R/W1C 0  0': Default; there is no active interrupt '1': There is a active interrupt from I2C3 */
#define VOE_SHIFT_UART0_ISR_STATUS                   20
#define VOE_BIT_UART0_ISR_STATUS                     ((u32)0x00000001 << 20)                             /*!<R/W1C 0  0': Default; there is no active interrupt '1': There is a active interrupt from UART0 */
#define VOE_SHIFT_ADC_ISR_STATUS                     19
#define VOE_BIT_ADC_ISR_STATUS                       ((u32)0x00000001 << 19)                             /*!<R/W1C 0  0': Default; there is no active interrupt '1': There is a active interrupt from ADC */
#define VOE_SHIFT_PWM_ISR_STATUS                     18
#define VOE_BIT_PWM_ISR_STATUS                       ((u32)0x00000001 << 18)                             /*!<R/W1C 0  0': Default; there is no active interrupt '1': There is a active interrupt from PWM */
#define VOE_SHIFT_GPIO_ISR_STATUS                    17
#define VOE_BIT_GPIO_ISR_STATUS                      ((u32)0x00000001 << 17)                             /*!<R/W1C 0  0': Default; there is no active interrupt '1': There is a active interrupt from GPIO */
#define VOE_SHIFT_TIMER_G0_ISR_STATUS                16
#define VOE_BIT_TIMER_G0_ISR_STATUS                  ((u32)0x00000001 << 16)                             /*!<R/W1C 0  0': Default; there is no active interrupt '1': There is a active interrupt from TimerGroup0 */
#define VOE_SHIFT_RSVD25                             9
#define VOE_MASK_RSVD25                              ((u32)0x0000007F << 9)                              /*!<R/W 0  RSVD */
#define VOE_SHIFT_ERAC_KM_FINISH                     8
#define VOE_BIT_ERAC_KM_FINISH                       ((u32)0x00000001 << 8)                              /*!<R/W1C 0  ERAC to KM , indicate erac finish. Asserted when ERAC finish wr/rd data to/from encoder/ISP */
#define VOE_SHIFT_RSVD26                             7
#define VOE_BIT_RSVD26                               ((u32)0x00000001 << 7)                              /*!<R/W 0  RSVD */
#define VOE_SHIFT_RSVD27                             6
#define VOE_BIT_RSVD27                               ((u32)0x00000001 << 6)                              /*!<R/W 0  RSVD */
#define VOE_SHIFT_RSVD28                             5
#define VOE_BIT_RSVD28                               ((u32)0x00000001 << 5)                              /*!<R/W 0  RSVD */
#define VOE_SHIFT_ISP_ISR_STATUS                     4
#define VOE_BIT_ISP_ISR_STATUS                       ((u32)0x00000001 << 4)                              /*!<R/W1C 0  0': Default; there is no active interrupt '1': There is a active interrupt from ISP */
#define VOE_SHIFT_RSVD29                             3
#define VOE_BIT_RSVD29                               ((u32)0x00000001 << 3)                              /*!<R/W 0  RSVD */
#define VOE_SHIFT_ENCODER_ISR_STATUS                 2
#define VOE_BIT_ENCODER_ISR_STATUS                   ((u32)0x00000001 << 2)                              /*!<R/W1C 0  0': Default; there is no active interrupt '1': There is a active interrupt from encoder */
#define VOE_SHIFT_RSVD30                             1
#define VOE_BIT_RSVD30                               ((u32)0x00000001 << 1)                              /*!<R/W 0  RSVD */
#define VOE_SHIFT_AP_MESSAGE_ISR_STATUS              0
#define VOE_BIT_AP_MESSAGE_ISR_STATUS                ((u32)0x00000001 << 0)                              /*!<R/W1C 0  0': Default; there is no active interrupt '1': When the external cpu set 0x0C[31] REG_SEND_MESSAGE_EXTERNAL_CTRL, FSM will set this bit to '1'. And this bit will be clear to '0' with writing '1'. */
/** @} */

/**************************************************************************//**
 * @defgroup VOE_REG_INTERRUPT_MASK_OF_KM
 * @brief  N/A                                       (@ 0X114)
 * @{
 *****************************************************************************/
#define VOE_SHIFT_RSVD31                             27
#define VOE_MASK_RSVD31                              ((u32)0x0000001F << 27)                             /*!<R/W 0  RSVD */
#define VOE_SHIFT_SCRYPTO_ISR_EN                     26
#define VOE_BIT_SCRYPTO_ISR_EN                       ((u32)0x00000001 << 26)                             /*!<R/W 0  0': Default; disable SCrypto interrupt '1': Enable SCrypto interrupt */
#define VOE_SHIFT_I2C2_ISR_EN                        25
#define VOE_BIT_I2C2_ISR_EN                          ((u32)0x00000001 << 25)                             /*!<R/W 0  0': Default; disable I2C2 interrupt '1': Enable I2C2 interrupt */
#define VOE_SHIFT_NN_ISR_EN                          24
#define VOE_BIT_NN_ISR_EN                            ((u32)0x00000001 << 24)                             /*!<R/W 0  0': Default; disable NN interrupt '1': Enable NN interrupt */
#define VOE_SHIFT_GDMA1_ISR_EN                       23
#define VOE_BIT_GDMA1_ISR_EN                         ((u32)0x00000001 << 23)                             /*!<R/W 0  0': Default; disable GDMA1 interrupt '1': Enable GDMA1 interrupt */
#define VOE_SHIFT_GDMA0_G0_ISR_EN                    22
#define VOE_BIT_GDMA0_G0_ISR_EN                      ((u32)0x00000001 << 22)                             /*!<R/W 0  0': Default; disable GDMA0 interrupt '1': Enable GDMA0 interrupt */
#define VOE_SHIFT_I2C3_ISR_EN                        21
#define VOE_BIT_I2C3_ISR_EN                          ((u32)0x00000001 << 21)                             /*!<R/W 0  0': Default; disable I2C3 interrupt '1': Enable I2C3 interrupt */
#define VOE_SHIFT_UART0_ISR_EN                       20
#define VOE_BIT_UART0_ISR_EN                         ((u32)0x00000001 << 20)                             /*!<R/W 0  0': Default; disable UART0 interrupt '1': Enable UART0 interrupt */
#define VOE_SHIFT_ADC_ISR_EN                         19
#define VOE_BIT_ADC_ISR_EN                           ((u32)0x00000001 << 19)                             /*!<R/W 0  0': Default; disable ADC interrupt '1': Enable ADC interrupt */
#define VOE_SHIFT_PWM_ISR_EN                         18
#define VOE_BIT_PWM_ISR_EN                           ((u32)0x00000001 << 18)                             /*!<R/W 0  0': Default; disable PWM interrupt '1': Enable PWM interrupt */
#define VOE_SHIFT_GPIO_ISR_EN                        17
#define VOE_BIT_GPIO_ISR_EN                          ((u32)0x00000001 << 17)                             /*!<R/W 0  0': Default; disable GPIO interrupt '1': Enable GPIO interrupt */
#define VOE_SHIFT_TIMER_G3_ISR_EN                    16
#define VOE_BIT_TIMER_G3_ISR_EN                      ((u32)0x00000001 << 16)                             /*!<R/W 0  0': Default; disable TimerGroup0 interrupt '1': Enable TimerGroup0 interrupt */
#define VOE_SHIFT_RSVD32                             9
#define VOE_MASK_RSVD32                              ((u32)0x0000007F << 9)                              /*!<R/W 0  RSVD */
#define VOE_SHIFT_ERAC_KM_ISR_EN                     8
#define VOE_BIT_ERAC_KM_ISR_EN                       ((u32)0x00000001 << 8)                              /*!<R/W 0  erac to km , erac finish interrupt */
#define VOE_SHIFT_RSVD33                             7
#define VOE_BIT_RSVD33                               ((u32)0x00000001 << 7)                              /*!<R/W 0  RSVD */
#define VOE_SHIFT_RSVD34                             6
#define VOE_BIT_RSVD34                               ((u32)0x00000001 << 6)                              /*!<R/W 0  RSVD */
#define VOE_SHIFT_RSVD35                             5
#define VOE_BIT_RSVD35                               ((u32)0x00000001 << 5)                              /*!<R/W 0  RSVD */
#define VOE_SHIFT_ISP_ISR_EN                         4
#define VOE_BIT_ISP_ISR_EN                           ((u32)0x00000001 << 4)                              /*!<R/W 0  0': Default; disable ISP interrupt '1': Enable ISP interrupt */
#define VOE_SHIFT_RSVD36                             3
#define VOE_BIT_RSVD36                               ((u32)0x00000001 << 3)                              /*!<R/W 0  RSVD */
#define VOE_SHIFT_ENCODER_ISR_EN                     2
#define VOE_BIT_ENCODER_ISR_EN                       ((u32)0x00000001 << 2)                              /*!<R/W 0  0': Default; disable encoder interrupt '1': Enable encoder interrupt */
#define VOE_SHIFT_RSVD37                             1
#define VOE_BIT_RSVD37                               ((u32)0x00000001 << 1)                              /*!<R/W 0  RSVD */
#define VOE_SHIFT_AP_MESSAGE_ISR_EN                  0
#define VOE_BIT_AP_MESSAGE_ISR_EN                    ((u32)0x00000001 << 0)                              /*!<R/W 0  0': Default; disable interrupt '1': Enable the interrupt where KM set 0x0C[31] REG_SEND_MESSAGE_EXTERNAL_CTRL. */
/** @} */

