Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/video/driver/RTL8735B/fcs_hal/rtl8735b_voe_type.h
/**************************************************************************//**
 * @defgroup VOE_REG_MBIST_REG
 * @brief  N/A                                       (@ 0X118)
 * @{
 *****************************************************************************/
#define VOE_SHIFT_RSVD38                             21
#define VOE_MASK_RSVD38                              ((u32)0x000007FF << 21)                             /*!<R/W 0  RSVD */
#define VOE_SHIFT_MEM_CONFIG                         16
#define VOE_MASK_MEM_CONFIG                          ((u32)0x0000001F << 16)                             /*!<R/W 0  {rtsel[1:0],wtsel[1:0],sram_pd} */
#define VOE_SHIFT_RSVD39                             13
#define VOE_MASK_RSVD39                              ((u32)0x00000007 << 13)                             /*!<R/W 0  RSVD */
#define VOE_SHIFT_MBIST_OUTPUTS                      8
#define VOE_MASK_MBIST_OUTPUTS                       ((u32)0x0000001F << 8)                              /*!<R 0  mbist result,{drf_bist_fail, bist_fail, drf_bist_done, drf_start_pause, bist_done} */
#define VOE_SHIFT_RSVD40                             5
#define VOE_MASK_RSVD40                              ((u32)0x00000007 << 5)                              /*!<R/W 0  RSVD */
#define VOE_SHIFT_MBIST_INPUTS                       0
#define VOE_MASK_MBIST_INPUTS                        ((u32)0x0000000F << 0)                              /*!<R/W 0  {drf_test_resume, drf_bist_mode, bist_mode, bist_rstn} */
/** @} */

/**************************************************************************//**
 * @defgroup VOE_REG_KM_DBGEN
 * @brief  N/A                                       (@ 0X11C)
 * @{
 *****************************************************************************/
#define VOE_SHIFT_RSVD41                             18
#define VOE_MASK_RSVD41                              ((u32)0x00003FFF << 18)                             /*!<R/W 0  RSVD */
#define VOE_SHIFT_SYST_CLK_EN                        17
#define VOE_BIT_SYST_CLK_EN                          ((u32)0x00000001 << 17)                             /*!<R/W 0  Systick clock enable: Systick would count if systick is enabled and syst_clk_en is 1'b1 at rising edge of cpu clock (sysclk_f) */
#define VOE_SHIFT_RETENTION_MODE                     16
#define VOE_BIT_RETENTION_MODE                       ((u32)0x00000001 << 16)                             /*!<R/W 0  After reset, KM/TM processor hardware automatically clears internal instruction and data caches by writing 0's to those cache memories. This input pin provides an alternative to keep cache contents when reset. That is, if the retention_mode input pin is tied to 1, the processor hardware will not clear caches after reset, so that cache contents will be retained. On the other hand, when tied to 0, the processor clear cache automatically. */
#define VOE_SHIFT_RSVD42                             14
#define VOE_MASK_RSVD42                              ((u32)0x00000003 << 14)                             /*!<RW 0  RSVD */
#define VOE_SHIFT_SL_SLEEPSYS_R                      13
#define VOE_BIT_SL_SLEEPSYS_R                        ((u32)0x00000001 << 13)                             /*!<R 0  Core is sleeping */
#define VOE_SHIFT_SYSRESET_REQ                       12
#define VOE_BIT_SYSRESET_REQ                         ((u32)0x00000001 << 12)                             /*!<R 0  KM system warm reset request */
#define VOE_SHIFT_RSVD43                             9
#define VOE_MASK_RSVD43                              ((u32)0x00000007 << 9)                              /*!<R/W 0  RSVD */
#define VOE_SHIFT_LOCKUP_M                           8
#define VOE_BIT_LOCKUP_M                             ((u32)0x00000001 << 8)                              /*!<R 0  Indicate whether KM CPU is locked or not */
#define VOE_SHIFT_HALTED_M                           7
#define VOE_BIT_HALTED_M                             ((u32)0x00000001 << 7)                              /*!<R 0  Indicate whether KM CPU is in debug mode (halting mode) or not */
#define VOE_SHIFT_DBGRESTARTED_M                     6
#define VOE_BIT_DBGRESTARTED_M                       ((u32)0x00000001 << 6)                              /*!<R 0  Indicate whether KM CPU is returning to normal mode from debug mode */
#define VOE_SHIFT_KM_DBGEN                           0
#define VOE_MASK_KM_DBGEN                            ((u32)0x0000003F << 0)                              /*!<R/W 0x0F  KM configuration register */
/** @} */

/**************************************************************************//**
 * @defgroup VOE_REG_KM_INITVTOR_S
 * @brief  N/A                                       (@ 0X120)
 * @{
 *****************************************************************************/
#define VOE_SHIFT_KM_INITVTOR_S                      0
#define VOE_MASK_KM_INITVTOR_S                       ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  KM configuration register */
/** @} */

/**************************************************************************//**
 * @defgroup VOE_REG_KM_INITVTOR_NS
 * @brief  N/A                                       (@ 0X124)
 * @{
 *****************************************************************************/
#define VOE_SHIFT_KM_INITVTOR_NS                     0
#define VOE_MASK_KM_INITVTOR_NS                      ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  KM configuration register */
/** @} */

/**************************************************************************//**
 * @defgroup VOE_REG_KM_INIT
 * @brief  N/A                                       (@ 0X128)
 * @{
 *****************************************************************************/
#define VOE_SHIFT_RSVD44                             6
#define VOE_MASK_RSVD44                              ((u32)0x03FFFFFF << 6)                              /*!<R/W 0  RSVD */
#define VOE_SHIFT_INITD2ITCM_S                       5
#define VOE_BIT_INITD2ITCM_S                         ((u32)0x00000001 << 5)                              /*!<R/W 1  Initial value of D2ITCM in ACTLR */
#define VOE_SHIFT_INITI2DTCM_S                       4
#define VOE_BIT_INITI2DTCM_S                         ((u32)0x00000001 << 4)                              /*!<R/W 1  Initial value of I2DTCM in ACTLR */
#define VOE_SHIFT_INITDTCMEN1_S                      3
#define VOE_BIT_INITDTCMEN1_S                        ((u32)0x00000001 << 3)                              /*!<R/W 1  Initial value of EN in DTCMCR1 */
#define VOE_SHIFT_INITDTCMEN0_S                      2
#define VOE_BIT_INITDTCMEN0_S                        ((u32)0x00000001 << 2)                              /*!<R/W 1  Initial value of EN in DTCMCR0 */
#define VOE_SHIFT_INITITCMEN1_S                      1
#define VOE_BIT_INITITCMEN1_S                        ((u32)0x00000001 << 1)                              /*!<R/W 1  Initial value of EN in ITCMCR1 */
#define VOE_SHIFT_INITITCMEN0_S                      0
#define VOE_BIT_INITITCMEN0_S                        ((u32)0x00000001 << 0)                              /*!<R/W 1  Initial value of EN in ITCMCR0 */
/** @} */

/**************************************************************************//**
 * @defgroup VOE_REG_KM_TMODE
 * @brief  N/A                                       (@ 0X12C)
 * @{
 *****************************************************************************/
#define VOE_SHIFT_RSVD45                             1
#define VOE_MASK_RSVD45                              ((u32)0x7FFFFFFF << 1)                              /*!<R/W 0  RSVD */
#define VOE_SHIFT_KM_TMODE                           0
#define VOE_BIT_KM_TMODE                             ((u32)0x00000001 << 0)                              /*!<R/W 0  KM bist mode */
/** @} */

/**************************************************************************//**
 * @defgroup VOE_REG_KM_CFG_CPU_NUM
 * @brief  N/A                                       (@ 0X130)
 * @{
 *****************************************************************************/
#define VOE_SHIFT_RSVD46                             10
#define VOE_MASK_RSVD46                              ((u32)0x003FFFFF << 10)                             /*!<R/W 0  RSVD */
#define VOE_SHIFT_KM_CFG_CPU_NUM                     0
#define VOE_MASK_KM_CFG_CPU_NUM                      ((u32)0x000003FF << 0)                              /*!<R/W 0  KM configuration register */
/** @} */

/**************************************************************************//**
 * @defgroup VOE_REG_MBIST_REG_FBCU_0
 * @brief  N/A                                       (@ 0X134)
 * @{
 *****************************************************************************/
#define VOE_SHIFT_RSVD47                             21
#define VOE_MASK_RSVD47                              ((u32)0x000007FF << 21)                             /*!<R/W 0  RSVD */
#define VOE_SHIFT_MEM_CONFIG_FBCU                    16
#define VOE_MASK_MEM_CONFIG_FBCU                     ((u32)0x0000001F << 16)                             /*!<R/W 110  {rtsel[0],tsel[1:0],turbo,sram_pd} */
#define VOE_SHIFT_RSVD48                             13
#define VOE_MASK_RSVD48                              ((u32)0x00000007 << 13)                             /*!<R/W 0  RSVD */
#define VOE_SHIFT_MBIST_OUTPUTS_FBCU_0               8
#define VOE_MASK_MBIST_OUTPUTS_FBCU_0                ((u32)0x0000001F << 8)                              /*!<R 0  mbist result,{drf_bist_fail, bist_fail, drf_bist_done, drf_start_pause, bist_done} */
#define VOE_SHIFT_RSVD49                             3
#define VOE_MASK_RSVD49                              ((u32)0x0000001F << 3)                              /*!<R/W 0  RSVD */
#define VOE_SHIFT_MBIST_INPUTS_FBCU_0                0
#define VOE_MASK_MBIST_INPUTS_FBCU_0                 ((u32)0x00000007 << 0)                              /*!<R/W 0  {drf_test_resume, drf_bist_mode, bist_mode} */
/** @} */

/**************************************************************************//**
 * @defgroup VOE_REG_MBIST_REG_FBCU_1
 * @brief  N/A                                       (@ 0X138)
 * @{
 *****************************************************************************/
#define VOE_SHIFT_RSVD50                             13
#define VOE_MASK_RSVD50                              ((u32)0x0007FFFF << 13)                             /*!<R/W 0  RSVD */
#define VOE_SHIFT_MBIST_OUTPUTS_FBCU_1               8
#define VOE_MASK_MBIST_OUTPUTS_FBCU_1                ((u32)0x0000001F << 8)                              /*!<R 0  mbist result,{drf_bist_fail, bist_fail, drf_bist_done, drf_start_pause, bist_done} */
#define VOE_SHIFT_RSVD51                             3
#define VOE_MASK_RSVD51                              ((u32)0x0000001F << 3)                              /*!<R/W 0  RSVD */
#define VOE_SHIFT_MBIST_INPUTS_FBCU_1                0
#define VOE_MASK_MBIST_INPUTS_FBCU_1                 ((u32)0x00000007 << 0)                              /*!<R/W 0  {drf_test_resume, drf_bist_mode, bist_mode} */
/** @} */

/**************************************************************************//**
 * @defgroup VOE_REG_KM_ADDRESS_REMAP_CTRL
 * @brief  N/A                                       (@ 0X13C)
 * @{
 *****************************************************************************/
#define VOE_SHIFT_RSVD52                             1
#define VOE_MASK_RSVD52                              ((u32)0x7FFFFFFF << 1)                              /*!<R/W 0  RSVD */
#define VOE_SHIFT_KM_REMAP_EN                        0
#define VOE_BIT_KM_REMAP_EN                          ((u32)0x00000001 << 0)                              /*!<R/W 0  0': Default; disable remap function '1': Enable remap function */
/** @} */

/**************************************************************************//**
 * @defgroup VOE_REG_KM_ITCM_REMAP_BASE
 * @brief  N/A                                       (@ 0X140)
 * @{
 *****************************************************************************/
#define VOE_SHIFT_KM_ITCM_REMAP_ADDRESS              0
#define VOE_MASK_KM_ITCM_REMAP_ADDRESS               ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  When 0x13C[0] equals to '1' and the address bit [29] KM sent equals to '0', decoder should execute the process that address bits [27:0] plus this register. Then hw should send this address to bus . */
/** @} */

/**************************************************************************//**
 * @defgroup VOE_REG_KM_DTCM_REMAP_BASE
 * @brief  N/A                                       (@ 0X144)
 * @{
 *****************************************************************************/
#define VOE_SHIFT_KM_DTCM_REMAP_ADDRESS              0
#define VOE_MASK_KM_DTCM_REMAP_ADDRESS               ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  When 0x13C[0] equals to '1' and the address bit [29] KM sent equals to '1', decoder should execute the process that address bits [27:0] plus this register. Then hw should send this address to bus . */
/** @} */

/**************************************************************************//**
 * @defgroup VOE_REG_MBIST_KM_ROM
 * @brief  N/A                                       (@ 0X148)
 * @{
 *****************************************************************************/
#define VOE_SHIFT_RSVD53                             9
#define VOE_MASK_RSVD53                              ((u32)0x007FFFFF << 9)                              /*!< 0  RSVD */
#define VOE_SHIFT_ROM_BIST_DONE                      8
#define VOE_BIT_ROM_BIST_DONE                        ((u32)0x00000001 << 8)                              /*!<R 0   */
#define VOE_SHIFT_ROM_RM_0                           4
#define VOE_MASK_ROM_RM_0                            ((u32)0x0000000F << 4)                              /*!<R/W 0  RSVD */
#define VOE_SHIFT_ROM_LS_0                           3
#define VOE_BIT_ROM_LS_0                             ((u32)0x00000001 << 3)                              /*!<R/W 0   */
#define VOE_SHIFT_ROM_RME_0                          2
#define VOE_BIT_ROM_RME_0                            ((u32)0x00000001 << 2)                              /*!<R/W 0   */
#define VOE_SHIFT_ROM_BIST_MODE                      1
#define VOE_BIT_ROM_BIST_MODE                        ((u32)0x00000001 << 1)                              /*!<R/W 0   */
#define VOE_SHIFT_ROM_BIST_RSTN                      0
#define VOE_BIT_ROM_BIST_RSTN                        ((u32)0x00000001 << 0)                              /*!<R/W 0   */
/** @} */

/**************************************************************************//**
 * @defgroup VOE_REG_MBIST_ROM_MISR_DOUT_H
 * @brief  N/A                                       (@ 0X14C)
 * @{
 *****************************************************************************/
#define VOE_SHIFT_MBIST_ROM_MISR_DOUT                0
#define VOE_MASK_MBIST_ROM_MISR_DOUT                 ((u32)0xFFFFFFFF << 0)                              /*!<R 0  misr_dout[63:32]; ITCM ROM */
/** @} */

/**************************************************************************//**
 * @defgroup VOE_REG_MBIST_ROM_MISR_DOUT_L
 * @brief  N/A                                       (@ 0X150)
 * @{
 *****************************************************************************/
#define VOE_SHIFT_MBIST_ROM_MISR_DOUT                0
#define VOE_MASK_MBIST_ROM_MISR_DOUT                 ((u32)0xFFFFFFFF << 0)                              /*!<R 0  misr_dout[31:0]; ITCM_ROM */
/** @} */

/**************************************************************************//**
 * @defgroup VOE_REG_MBIST_KM_RAM_WR
 * @brief  N/A                                       (@ 0X154)
 * @{
 *****************************************************************************/
#define VOE_SHIFT_RSVD54                             10
#define VOE_MASK_RSVD54                              ((u32)0x003FFFFF << 10)                             /*!< 0  RSVD */
#define VOE_SHIFT_ITCM_DRF_TEST_RESUME               9
#define VOE_BIT_ITCM_DRF_TEST_RESUME                 ((u32)0x00000001 << 9)                              /*!<R/W 0   */
#define VOE_SHIFT_ITCM_PD_0                          8
#define VOE_BIT_ITCM_PD_0                            ((u32)0x00000001 << 8)                              /*!<R/W 0   */
#define VOE_SHIFT_ITCM_DRF_BIST_MODE                 7
#define VOE_BIT_ITCM_DRF_BIST_MODE                   ((u32)0x00000001 << 7)                              /*!<R/W 0  RSVD */
#define VOE_SHIFT_ITCM_BIST_MODE                     6
#define VOE_BIT_ITCM_BIST_MODE                       ((u32)0x00000001 << 6)                              /*!<R/W 0   */
#define VOE_SHIFT_ITCM_BIST_RSTN                     5
#define VOE_BIT_ITCM_BIST_RSTN                       ((u32)0x00000001 << 5)                              /*!<R/W 0   */
#define VOE_SHIFT_DTCM_DRF_TEST_RESUME               4
#define VOE_BIT_DTCM_DRF_TEST_RESUME                 ((u32)0x00000001 << 4)                              /*!<R/W 0   */
#define VOE_SHIFT_DTCM_PD_0                          3
#define VOE_BIT_DTCM_PD_0                            ((u32)0x00000001 << 3)                              /*!<R/W 0   */
#define VOE_SHIFT_DTCM_DRF_BIST_MODE                 2
#define VOE_BIT_DTCM_DRF_BIST_MODE                   ((u32)0x00000001 << 2)                              /*!<R/W 0   */
#define VOE_SHIFT_DTCM_BIST_MODE                     1
#define VOE_BIT_DTCM_BIST_MODE                       ((u32)0x00000001 << 1)                              /*!<R/W 0   */
#define VOE_SHIFT_DTCM_BIST_RSTN                     0
#define VOE_BIT_DTCM_BIST_RSTN                       ((u32)0x00000001 << 0)                              /*!<R/W 0   */
/** @} */

/**************************************************************************//**
 * @defgroup VOE_REG_MBIST_KM_RAM_RD
 * @brief  N/A                                       (@ 0X158)
 * @{
 *****************************************************************************/
#define VOE_SHIFT_RSVD55                             10
#define VOE_MASK_RSVD55                              ((u32)0x003FFFFF << 10)                             /*!<R 0   */
#define VOE_SHIFT_ITCM_DRF_START_PAUSE               9
#define VOE_BIT_ITCM_DRF_START_PAUSE                 ((u32)0x00000001 << 9)                              /*!<R 0   */
#define VOE_SHIFT_ITCM_DRF_BIST_FAIL                 8
#define VOE_BIT_ITCM_DRF_BIST_FAIL                   ((u32)0x00000001 << 8)                              /*!<R 0   */
#define VOE_SHIFT_ITCM_BIST_FAIL                     7
#define VOE_BIT_ITCM_BIST_FAIL                       ((u32)0x00000001 << 7)                              /*!<R 0   */
#define VOE_SHIFT_ITCM_DRF_BIST_DONE                 6
#define VOE_BIT_ITCM_DRF_BIST_DONE                   ((u32)0x00000001 << 6)                              /*!<R 0   */
#define VOE_SHIFT_ITCM_BIST_DONE                     5
#define VOE_BIT_ITCM_BIST_DONE                       ((u32)0x00000001 << 5)                              /*!<R 0   */
#define VOE_SHIFT_DTCM_DRF_START_PAUSE               4
#define VOE_BIT_DTCM_DRF_START_PAUSE                 ((u32)0x00000001 << 4)                              /*!<R 0   */
#define VOE_SHIFT_DTCM_DRF_BIST_FAIL                 3
#define VOE_BIT_DTCM_DRF_BIST_FAIL                   ((u32)0x00000001 << 3)                              /*!<R 0   */
#define VOE_SHIFT_DTCM_BIST_FAIL                     2
#define VOE_BIT_DTCM_BIST_FAIL                       ((u32)0x00000001 << 2)                              /*!<R 0   */
#define VOE_SHIFT_DTCM_DRF_BIST_DONE                 1
#define VOE_BIT_DTCM_DRF_BIST_DONE                   ((u32)0x00000001 << 1)                              /*!<R 0   */
#define VOE_SHIFT_DTCM_BIST_DONE                     0
#define VOE_BIT_DTCM_BIST_DONE                       ((u32)0x00000001 << 0)                              /*!<R 0   */
/** @} */

/**************************************************************************//**
 * @defgroup VOE_REG_MBIST_DTCM_ROM_MISR_DOUT_H
 * @brief  N/A                                       (@ 0X15C)
 * @{
 *****************************************************************************/
#define VOE_SHIFT_MBIST_DTCM_ROM_MISR_DOUT           0
#define VOE_MASK_MBIST_DTCM_ROM_MISR_DOUT            ((u32)0xFFFFFFFF << 0)                              /*!<R 0  DTCM ROM */
/** @} */

/**************************************************************************//**
 * @defgroup VOE_REG_MBIST_DTCM_ROM_MISR_DOUT_L
 * @brief  N/A                                       (@ 0X160)
 * @{
 *****************************************************************************/
#define VOE_SHIFT_MBIST_DTCM_ROM_MISR_DOUT           0
#define VOE_MASK_MBIST_DTCM_ROM_MISR_DOUT            ((u32)0xFFFFFFFF << 0)                              /*!<R 0  DTCM ROM */
/** @} */

/**************************************************************************//**
 * @defgroup VOE_REG_PC_VALUE
 * @brief  N/A                                       (@ 0X164)
 * @{
 *****************************************************************************/
#define VOE_SHIFT_PC_VALUE                           0
#define VOE_MASK_PC_VALUE                            ((u32)0xFFFFFFFF << 0)                              /*!<R 0  KM pc value */
/** @} */

/**************************************************************************//**
 * @defgroup VOE_REG_RETIRED_INSTRUCTION_ADDR_0
 * @brief  N/A                                       (@ 0X168)
 * @{
 *****************************************************************************/
#define VOE_SHIFT_RETIRED_INSTRUCTION_ADDR_0         0
#define VOE_MASK_RETIRED_INSTRUCTION_ADDR_0          ((u32)0xFFFFFFFF << 0)                              /*!<R 0   */
/** @} */

/**************************************************************************//**
 * @defgroup VOE_REG_RETIRED_INSTRUCTION_ADDR_1
 * @brief  N/A                                       (@ 0X16C)
 * @{
 *****************************************************************************/
#define VOE_SHIFT_RETIRED_INSTRUCTION_ADDR_1         0
#define VOE_MASK_RETIRED_INSTRUCTION_ADDR_1          ((u32)0xFFFFFFFF << 0)                              /*!<R 0   */
/** @} */

