Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/video/driver/RTL8735B/fcs_hal/rtl8735b_voe_type.h
/**************************************************************************//**
 * @defgroup VOE_REG_VOE_WATCHDOG_CTRL
 * @brief  N/A                                       (@ 0X170)
 * @{
 *****************************************************************************/
#define VOE_SHIFT_WDT_TO                             31
#define VOE_BIT_WDT_TO                               ((u32)0x00000001 << 31)                             /*!<R/W1C 0  Watch dog timer timeout. 1 cycle pulse */
#define VOE_SHIFT_WDT_MODE                           30
#define VOE_BIT_WDT_MODE                             ((u32)0x00000001 << 30)                             /*!<R/W 0  0: Interrupt CPU when WDT timer counter is overflow. 1: Reset system when WDT timer counter is overflow. */
#define VOE_SHIFT_RSVD56                             29
#define VOE_BIT_RSVD56                               ((u32)0x00000001 << 29)                             /*!<R 0   */
#define VOE_SHIFT_CNT_LIMIT                          25
#define VOE_MASK_CNT_LIMIT                           ((u32)0x0000000F << 25)                             /*!<R/W 0  0: 0x001 1: 0x003 2: 0x007 3: 0x00F 4: 0x01F 5: 0x03F 6: 0x07F 7: 0x0FF 8: 0x1FF 9: 0x3FF 10: 0x7FF 11~15: 0xFFF Watchdog Count= (0x00000001 << (CNT_LIMIT + 1)) - 1 */
#define VOE_SHIFT_WDT_CLEAR                          24
#define VOE_BIT_WDT_CLEAR                            ((u32)0x00000001 << 24)                             /*!<W1C 0  Write 1 to clear timer */
#define VOE_SHIFT_RSVD57                             17
#define VOE_MASK_RSVD57                              ((u32)0x0000007F << 17)                             /*!<R 0   */
#define VOE_SHIFT_WDT_EN_BYTE                        16
#define VOE_BIT_WDT_EN_BYTE                          ((u32)0x00000001 << 16)                             /*!<R/W 0  Set 1 to enable watch dog timer */
#define VOE_SHIFT_VNDR_DIVFACTOR                     0
#define VOE_MASK_VNDR_DIVFACTOR                      ((u32)0x0000FFFF << 0)                              /*!<R/W 1  Dividing factor. Watch dog timer is count with 32KHz/(divfactor+1). Minimum dividing factor is 1. */
/** @} */

/**************************************************************************//**
 * @defgroup VOE_REG_ERAC_CTRL
 * @brief  N/A                                       (@ 0X200)
 * @{
 *****************************************************************************/
#define VOE_SHIFT_RSVD58                             3
#define VOE_MASK_RSVD58                              ((u32)0x1FFFFFFF << 3)                              /*!<R/W 0  RSVD */
#define VOE_SHIFT_ERAC_RST_DIS                       2
#define VOE_BIT_ERAC_RST_DIS                         ((u32)0x00000001 << 2)                              /*!<R/W 0  0: disable erac, 1: enable erac.(keep stable when ERAC_RD_EN/ERAC_WR_EN asserted) */
#define VOE_SHIFT_ERAC_RD_EN                         1
#define VOE_BIT_ERAC_RD_EN                           ((u32)0x00000001 << 1)                              /*!<R/W 0  Auto reset to 0 when erac read/write finished. BIT_ERAC_RD_EN and BIT_ERAC_WR_EN can not be asserted at the same time */
#define VOE_SHIFT_ERAC_WR_EN                         0
#define VOE_BIT_ERAC_WR_EN                           ((u32)0x00000001 << 0)                              /*!<R/W 0  Auto reset to 0 when erac read/write finished. BIT_ERAC_RD_EN and BIT_ERAC_WR_EN can not be asserted at the same time */
/** @} */

/**************************************************************************//**
 * @defgroup VOE_REG_ERAC_NUM_WR
 * @brief  N/A                                       (@ 0X204)
 * @{
 *****************************************************************************/
#define VOE_SHIFT_RSVD59                             9
#define VOE_MASK_RSVD59                              ((u32)0x007FFFFF << 9)                              /*!<R/W 0  RSVD */
#define VOE_SHIFT_ERAC_NUM_WR                        0
#define VOE_MASK_ERAC_NUM_WR                         ((u32)0x000001FF << 0)                              /*!<R/W 0  gives number of external memory to be written. Range: 1-512 (keep stable when BIT_ERAC_RD_EN/BIT_ERAC_WR_EN asserted) */
/** @} */

/**************************************************************************//**
 * @defgroup VOE_REG_ERAC_SMBA_OA_WR
 * @brief  N/A                                       (@ 0X208)
 * @{
 *****************************************************************************/
#define VOE_SHIFT_RSVD60                             13
#define VOE_MASK_RSVD60                              ((u32)0x0007FFFF << 13)                             /*!<R/W 0  RSVD */
#define VOE_SHIFT_ERAC_SMBA_OA_WR                    0
#define VOE_MASK_ERAC_SMBA_OA_WR                     ((u32)0x00001FFF << 0)                              /*!<R/W 0  address of the table stored the address of the registers to be written. (keep stable when BIT_ERAC_RD_EN/BIT_ERAC_WR_EN asserted) */
/** @} */

/**************************************************************************//**
 * @defgroup VOE_REG_ERAC_SMBA_WR
 * @brief  N/A                                       (@ 0X20C)
 * @{
 *****************************************************************************/
#define VOE_SHIFT_RSVD61                             13
#define VOE_MASK_RSVD61                              ((u32)0x0007FFFF << 13)                             /*!<R/W 0  RSVD */
#define VOE_SHIFT_ERAC_SMBA_WR                       0
#define VOE_MASK_ERAC_SMBA_WR                        ((u32)0x00001FFF << 0)                              /*!<R/W 0  address offset of the data to be write in shared memory (keep stable when BIT_ERAC_RD_EN/BIT_ERAC_WR_EN asserted) */
/** @} */

/**************************************************************************//**
 * @defgroup VOE_REG_ERAC_ERBA_WR
 * @brief  N/A                                       (@ 0X210)
 * @{
 *****************************************************************************/
#define VOE_SHIFT_ERAC_ERBA_WR                       0
#define VOE_MASK_ERAC_ERBA_WR                        ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  address offset of the data to be wirte in external mem (keep stable when BIT_ERAC_RD_EN/BIT_ERAC_WR_EN asserted) */
/** @} */

/**************************************************************************//**
 * @defgroup VOE_REG_ERAC_NUM_RD
 * @brief  N/A                                       (@ 0X214)
 * @{
 *****************************************************************************/
#define VOE_SHIFT_RSVD62                             9
#define VOE_MASK_RSVD62                              ((u32)0x007FFFFF << 9)                              /*!<R/W 0  RSVD */
#define VOE_SHIFT_ERAC_NUM_RD                        0
#define VOE_MASK_ERAC_NUM_RD                         ((u32)0x000001FF << 0)                              /*!<R/W 0  gives number of external memory to be read. Range: 1-512 (keep stable when BIT_ERAC_RD_EN/BIT_ERAC_WR_EN asserted) */
/** @} */

/**************************************************************************//**
 * @defgroup VOE_REG_ERAC_SMBA_OA_RD
 * @brief  N/A                                       (@ 0X218)
 * @{
 *****************************************************************************/
#define VOE_SHIFT_RSVD63                             13
#define VOE_MASK_RSVD63                              ((u32)0x0007FFFF << 13)                             /*!<R/W 0  TBD */
#define VOE_SHIFT_ERAC_SMBA_OA_RD                    0
#define VOE_MASK_ERAC_SMBA_OA_RD                     ((u32)0x00001FFF << 0)                              /*!<R/W 0  address of the table stored the address of the registers to be read (keep stable when BIT_ERAC_RD_EN/BIT_ERAC_WR_EN asserted) */
/** @} */

/**************************************************************************//**
 * @defgroup VOE_REG_ERAC_SMBA_RD
 * @brief  N/A                                       (@ 0X21C)
 * @{
 *****************************************************************************/
#define VOE_SHIFT_RSVD64                             13
#define VOE_MASK_RSVD64                              ((u32)0x0007FFFF << 13)                             /*!<R/W 0  TBD */
#define VOE_SHIFT_ERAC_SMBA_RD                       0
#define VOE_MASK_ERAC_SMBA_RD                        ((u32)0x00001FFF << 0)                              /*!<R/W 0  address offset of the data to be read in shared memory (keep stable when BIT_ERAC_RD_EN/BIT_ERAC_WR_EN asserted) */
/** @} */

/**************************************************************************//**
 * @defgroup VOE_REG_ERAC_ERBA_RD
 * @brief  N/A                                       (@ 0X220)
 * @{
 *****************************************************************************/
#define VOE_SHIFT_ERAC_ERBA_RD                       0
#define VOE_MASK_ERAC_ERBA_RD                        ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  address offset of the data to be read in external mem (keep stable when BIT_ERAC_RD_EN/BIT_ERAC_WR_EN asserted) */
/** @} */

/**************************************************************************//**
 * @defgroup rtl8735b_VOE
 * @{
 * @brief rtl8735b_VOE Register Declaration
 *****************************************************************************/
typedef struct {
	__IO uint32_t VOE_REG_VOE_SYSTEM_CTRL ;                /*!<  N/A register,  Address offset: 0x00 */
	__IO uint32_t VOE_REG_KM_FW_BASE_ADDRESS ;             /*!<  N/A register,  Address offset: 0x04 */
	__IO uint32_t VOE_REG_KM_FW_LEN ;                      /*!<  N/A register,  Address offset: 0x08 */
	__IO uint32_t VOE_REG_SEND_MESSAGE_EXTERNAL_CTRL ;     /*!<  N/A register,  Address offset: 0x0C */
	__IO uint32_t VOE_REG_READ_MESSAGE_EXTERNAL_CTRL ;     /*!<  N/A register,  Address offset: 0x10 */
	__IO uint32_t VOE_REG_INTERRUPT_STATUS_OF_EXTERNAL_CPU ;/*!<  N/A register,  Address offset: 0x14 */
	__IO uint32_t VOE_REG_INTERRUPT_MASK_OF_EXTERNAL_CPU ; /*!<  N/A register,  Address offset: 0x18 */
	__IO uint32_t VOE_RSVD ;                               /*!<  N/A register,  Address offset: 0x1C */
	__IO uint32_t RSVD0[56];                               /*!<  Reserved,  Address offset:0x20-0xFC */
	__IO uint32_t VOE_REG_VOE_ARB_PRIORITY_CTRL0 ;         /*!<  N/A register,  Address offset: 0x100 */
	__IO uint32_t VOE_REG_VOE_ARB_PRIORITY_CTRL1 ;         /*!<  N/A register,  Address offset: 0x104 */
	__IO uint32_t VOE_REG_SEND_MESSAGE_KM_CTRL ;           /*!<  N/A register,  Address offset: 0x108 */
	__IO uint32_t VOE_REG_READ_MESSAGE_KM_CTRL ;           /*!<  N/A register,  Address offset: 0x10C */
	__IO uint32_t VOE_REG_INTERRUPT_STATUS_OF_KM ;         /*!<  N/A register,  Address offset: 0x110 */
	__IO uint32_t VOE_REG_INTERRUPT_MASK_OF_KM ;           /*!<  N/A register,  Address offset: 0x114 */
	__IO uint32_t VOE_REG_MBIST_REG ;                      /*!<  N/A register,  Address offset: 0x118 */
	__IO uint32_t VOE_REG_KM_DBGEN ;                       /*!<  N/A register,  Address offset: 0x11C */
	__IO uint32_t VOE_REG_KM_INITVTOR_S ;                  /*!<  N/A register,  Address offset: 0x120 */
	__IO uint32_t VOE_REG_KM_INITVTOR_NS ;                 /*!<  N/A register,  Address offset: 0x124 */
	__IO uint32_t VOE_REG_KM_INIT ;                        /*!<  N/A register,  Address offset: 0x128 */
	__IO uint32_t VOE_REG_KM_TMODE ;                       /*!<  N/A register,  Address offset: 0x12C */
	__IO uint32_t VOE_REG_KM_CFG_CPU_NUM ;                 /*!<  N/A register,  Address offset: 0x130 */
	__IO uint32_t VOE_REG_MBIST_REG_FBCU_0 ;               /*!<  N/A register,  Address offset: 0x134 */
	__IO uint32_t VOE_REG_MBIST_REG_FBCU_1 ;               /*!<  N/A register,  Address offset: 0x138 */
	__IO uint32_t VOE_REG_KM_ADDRESS_REMAP_CTRL ;          /*!<  N/A register,  Address offset: 0x13C */
	__IO uint32_t VOE_REG_KM_ITCM_REMAP_BASE ;             /*!<  N/A register,  Address offset: 0x140 */
	__IO uint32_t VOE_REG_KM_DTCM_REMAP_BASE ;             /*!<  N/A register,  Address offset: 0x144 */
	__IO uint32_t VOE_REG_MBIST_KM_ROM ;                   /*!<  N/A register,  Address offset: 0x148 */
	__I  uint32_t VOE_REG_MBIST_ROM_MISR_DOUT_H ;          /*!<  N/A register,  Address offset: 0x14C */
	__I  uint32_t VOE_REG_MBIST_ROM_MISR_DOUT_L ;          /*!<  N/A register,  Address offset: 0x150 */
	__IO uint32_t VOE_REG_MBIST_KM_RAM_WR ;                /*!<  N/A register,  Address offset: 0x154 */
	__I  uint32_t VOE_REG_MBIST_KM_RAM_RD ;                /*!<  N/A register,  Address offset: 0x158 */
	__I  uint32_t VOE_REG_MBIST_DTCM_ROM_MISR_DOUT_H ;     /*!<  N/A register,  Address offset: 0x15C */
	__I  uint32_t VOE_REG_MBIST_DTCM_ROM_MISR_DOUT_L ;     /*!<  N/A register,  Address offset: 0x160 */
	__I  uint32_t VOE_REG_PC_VALUE ;                       /*!<  N/A register,  Address offset: 0x164 */
	__I  uint32_t VOE_REG_RETIRED_INSTRUCTION_ADDR_0 ;     /*!<  N/A register,  Address offset: 0x168 */
	__I  uint32_t VOE_REG_RETIRED_INSTRUCTION_ADDR_1 ;     /*!<  N/A register,  Address offset: 0x16C */
	__IO uint32_t VOE_REG_VOE_WATCHDOG_CTRL ;              /*!<  N/A register,  Address offset: 0x170 */
	__IO uint32_t RSVD1[35];                               /*!<  Reserved,  Address offset:0x174-0x1FC */
	__IO uint32_t VOE_REG_ERAC_CTRL ;                      /*!<  N/A register,  Address offset: 0x200 */
	__IO uint32_t VOE_REG_ERAC_NUM_WR ;                    /*!<  N/A register,  Address offset: 0x204 */
	__IO uint32_t VOE_REG_ERAC_SMBA_OA_WR ;                /*!<  N/A register,  Address offset: 0x208 */
	__IO uint32_t VOE_REG_ERAC_SMBA_WR ;                   /*!<  N/A register,  Address offset: 0x20C */
	__IO uint32_t VOE_REG_ERAC_ERBA_WR ;                   /*!<  N/A register,  Address offset: 0x210 */
	__IO uint32_t VOE_REG_ERAC_NUM_RD ;                    /*!<  N/A register,  Address offset: 0x214 */
	__IO uint32_t VOE_REG_ERAC_SMBA_OA_RD ;                /*!<  N/A register,  Address offset: 0x218 */
	__IO uint32_t VOE_REG_ERAC_SMBA_RD ;                   /*!<  N/A register,  Address offset: 0x21C */
	__IO uint32_t VOE_REG_ERAC_ERBA_RD ;                   /*!<  N/A register,			Address offset: 0x220 */
} VOE_TypeDef;
/** @} */

#endif
